//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// console.log(friends.length)
// if (friends.length>=3){
//     console.log('Це великий масив')  // or alert
// }else{
//     console.log('Маленький масив'); // or alert
// }
// // or
// friends.length>=3 ? console.log('Це великий масив') : console.log('Маленький масив');


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = + prompt('First')
// let b = + prompt('Second')
// let c = + prompt('Third')
// console.log(a, b, c)
//
// if (a>b && b>c){
//     console.log(`Середнім є число ${b}`)
// } else if (a>c && c>b ) {
//     console.log(`Середнім є число ${c}`);
// } else if (b>a && a>c) {
//     console.log(`Середнім є число ${a}`)
// } else if (b>c && c>a) {
//     console.log(`Середнім є число ${c}`)
// }else if (c>a && a>b) {
//     console.log(`Середнім є число ${a}`)
// }else if (c>b && b>a) {
//     console.log(`Середнім є число ${b}`)
// } else {console.log('треба допрацювати')}
//
// if ((b>a && a>c) || (c>a && a>b)) {
//     console.log(`Число ${a} знаходиться між двома іншими`)}
// else {console.log(`Число ${a} не знаходиться між двома іншими`)}


// - Перепишіть конструкцію if з використанням умовного оператора '?':

// let result;
// let a = + prompt('a');
// let b = + prompt('b');
//     // if (a + b < 4) {
//     //     result = 'Мало';
//     // } else {
//     //     result = 'Багато';
//     // }
//     (a + b < 4) ? result = 'Мало' : result = 'Багато';
// console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let rand = 0;
// rand === 0 ? console.log('Число є нулем') : rand > 0 ? console.log('Позитивне') : console.log('Негативне');


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// const test = false;
//
// if(test) {
//     console.log('Вірно');
// }else {
//     console.log('Неправильно');
// }
// test ? console.log('Вірно') : console.log('Неправильно');


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// const js = prompt('Яка «офіційна» назва JavaScript?');
// if (js==='ECMAScript') {
//     alert('Правильно!');
// } else {
//     alert('Не знаєте? ECMAScript!')
// }
// js === 'ECMAScript' ? alert('Правильно!') : alert('Не знаєте? ECMAScript!');


//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let kvartura = + prompt('Введіть номер квартири');
// if (kvartura > 0 && kvartura <= 20) {
//     console.log('Перший під\'їзд');
// } else if (kvartura > 20 && kvartura <= 48) {
//     console.log('Другий під\'їзд');
// }else if (kvartura > 48 && kvartura <= 90) {
//     console.log('Третій під\'їзд');
// }else {console.log('Інакший будинок')}



// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// const number = 101
// number === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО')


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// const temp = 15;
// (temp >= 10 && temp <= 22) ? console.log('ми йдемо ВЧИТИСЯ') : console.log('сидимо вдома і вчимося ОНЛАЙН');


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .


// const numb = 3;
// switch (numb){
//     case 1:
//         console.log('Ви отримали приз Авто');
//         break;
//     case 2:
//         console.log('Ви отримали приз Мото');
//         break;
//     case 3:
//         console.log('Ви отримали приз Телефон');
//         break;
//     case 4:
//         console.log('Ви отримали приз Квартиру');
//         break;
//     case 5:
//         console.log('Ви отримали приз Ноутбук');
//         break;
//     default:
//         console.log('Число не вірне!')
//         break;
// }